# LegendComponentLength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LegendComponentLength Property
ParameterTypeId Class See Also
---
"Host Length"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LegendComponentLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LegendComponentLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LegendComponentLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace